GopalSaraf/Practicals/PSDL/include/proc/pic16f17144.h
extern volatile TMR1GATEbits_t TMR1GATEbits __at(0x310);
// bitfield macros
#define _TMR1GATE_GSS_POSN                                  0x0
#define _TMR1GATE_GSS_POSITION                              0x0
#define _TMR1GATE_GSS_SIZE                                  0x5
#define _TMR1GATE_GSS_LENGTH                                0x5
#define _TMR1GATE_GSS_MASK                                  0x1F
#define _TMR1GATE_GSS0_POSN                                 0x0
#define _TMR1GATE_GSS0_POSITION                             0x0
#define _TMR1GATE_GSS0_SIZE                                 0x1
#define _TMR1GATE_GSS0_LENGTH                               0x1
#define _TMR1GATE_GSS0_MASK                                 0x1
#define _TMR1GATE_GSS1_POSN                                 0x1
#define _TMR1GATE_GSS1_POSITION                             0x1
#define _TMR1GATE_GSS1_SIZE                                 0x1
#define _TMR1GATE_GSS1_LENGTH                               0x1
#define _TMR1GATE_GSS1_MASK                                 0x2
#define _TMR1GATE_GSS2_POSN                                 0x2
#define _TMR1GATE_GSS2_POSITION                             0x2
#define _TMR1GATE_GSS2_SIZE                                 0x1
#define _TMR1GATE_GSS2_LENGTH                               0x1
#define _TMR1GATE_GSS2_MASK                                 0x4
#define _TMR1GATE_GSS3_POSN                                 0x3
#define _TMR1GATE_GSS3_POSITION                             0x3
#define _TMR1GATE_GSS3_SIZE                                 0x1
#define _TMR1GATE_GSS3_LENGTH                               0x1
#define _TMR1GATE_GSS3_MASK                                 0x8
#define _TMR1GATE_GSS4_POSN                                 0x4
#define _TMR1GATE_GSS4_POSITION                             0x4
#define _TMR1GATE_GSS4_SIZE                                 0x1
#define _TMR1GATE_GSS4_LENGTH                               0x1
#define _TMR1GATE_GSS4_MASK                                 0x10
#define _TMR1GATE_T1GSS0_POSN                               0x0
#define _TMR1GATE_T1GSS0_POSITION                           0x0
#define _TMR1GATE_T1GSS0_SIZE                               0x1
#define _TMR1GATE_T1GSS0_LENGTH                             0x1
#define _TMR1GATE_T1GSS0_MASK                               0x1
#define _TMR1GATE_T1GSS1_POSN                               0x1
#define _TMR1GATE_T1GSS1_POSITION                           0x1
#define _TMR1GATE_T1GSS1_SIZE                               0x1
#define _TMR1GATE_T1GSS1_LENGTH                             0x1
#define _TMR1GATE_T1GSS1_MASK                               0x2
#define _TMR1GATE_T1GSS2_POSN                               0x2
#define _TMR1GATE_T1GSS2_POSITION                           0x2
#define _TMR1GATE_T1GSS2_SIZE                               0x1
#define _TMR1GATE_T1GSS2_LENGTH                             0x1
#define _TMR1GATE_T1GSS2_MASK                               0x4
#define _TMR1GATE_T1GSS3_POSN                               0x3
#define _TMR1GATE_T1GSS3_POSITION                           0x3
#define _TMR1GATE_T1GSS3_SIZE                               0x1
#define _TMR1GATE_T1GSS3_LENGTH                             0x1
#define _TMR1GATE_T1GSS3_MASK                               0x8
#define _TMR1GATE_T1GSS4_POSN                               0x4
#define _TMR1GATE_T1GSS4_POSITION                           0x4
#define _TMR1GATE_T1GSS4_SIZE                               0x1
#define _TMR1GATE_T1GSS4_LENGTH                             0x1
#define _TMR1GATE_T1GSS4_MASK                               0x10

// Register: T1CLK
#define T1CLK T1CLK
extern volatile unsigned char           T1CLK               __at(0x311);
#ifndef _LIB_BUILD
asm("T1CLK equ 0311h");
#endif
// aliases
extern volatile unsigned char           TMR1CLK             __at(0x311);
#ifndef _LIB_BUILD
asm("TMR1CLK equ 0311h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :8;
    };
    struct {
        unsigned T1CS0                  :1;
        unsigned T1CS1                  :1;
        unsigned T1CS2                  :1;
        unsigned T1CS3                  :1;
        unsigned T1CS4                  :1;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
        unsigned CS4                    :1;
    };
} T1CLKbits_t;
extern volatile T1CLKbits_t T1CLKbits __at(0x311);
// bitfield macros
#define _T1CLK_CS_POSN                                      0x0
#define _T1CLK_CS_POSITION                                  0x0
#define _T1CLK_CS_SIZE                                      0x8
#define _T1CLK_CS_LENGTH                                    0x8
#define _T1CLK_CS_MASK                                      0xFF
#define _T1CLK_T1CS0_POSN                                   0x0
#define _T1CLK_T1CS0_POSITION                               0x0
#define _T1CLK_T1CS0_SIZE                                   0x1
#define _T1CLK_T1CS0_LENGTH                                 0x1
#define _T1CLK_T1CS0_MASK                                   0x1
#define _T1CLK_T1CS1_POSN                                   0x1
#define _T1CLK_T1CS1_POSITION                               0x1
#define _T1CLK_T1CS1_SIZE                                   0x1
#define _T1CLK_T1CS1_LENGTH                                 0x1
#define _T1CLK_T1CS1_MASK                                   0x2
#define _T1CLK_T1CS2_POSN                                   0x2
#define _T1CLK_T1CS2_POSITION                               0x2
#define _T1CLK_T1CS2_SIZE                                   0x1
#define _T1CLK_T1CS2_LENGTH                                 0x1
#define _T1CLK_T1CS2_MASK                                   0x4
#define _T1CLK_T1CS3_POSN                                   0x3
#define _T1CLK_T1CS3_POSITION                               0x3
#define _T1CLK_T1CS3_SIZE                                   0x1
#define _T1CLK_T1CS3_LENGTH                                 0x1
#define _T1CLK_T1CS3_MASK                                   0x8
#define _T1CLK_T1CS4_POSN                                   0x4
#define _T1CLK_T1CS4_POSITION                               0x4
#define _T1CLK_T1CS4_SIZE                                   0x1
#define _T1CLK_T1CS4_LENGTH                                 0x1
#define _T1CLK_T1CS4_MASK                                   0x10
#define _T1CLK_CS0_POSN                                     0x0
#define _T1CLK_CS0_POSITION                                 0x0
#define _T1CLK_CS0_SIZE                                     0x1
#define _T1CLK_CS0_LENGTH                                   0x1
#define _T1CLK_CS0_MASK                                     0x1
#define _T1CLK_CS1_POSN                                     0x1
#define _T1CLK_CS1_POSITION                                 0x1
#define _T1CLK_CS1_SIZE                                     0x1
#define _T1CLK_CS1_LENGTH                                   0x1
#define _T1CLK_CS1_MASK                                     0x2
#define _T1CLK_CS2_POSN                                     0x2
#define _T1CLK_CS2_POSITION                                 0x2
#define _T1CLK_CS2_SIZE                                     0x1
#define _T1CLK_CS2_LENGTH                                   0x1
#define _T1CLK_CS2_MASK                                     0x4
#define _T1CLK_CS3_POSN                                     0x3
#define _T1CLK_CS3_POSITION                                 0x3
#define _T1CLK_CS3_SIZE                                     0x1
#define _T1CLK_CS3_LENGTH                                   0x1
#define _T1CLK_CS3_MASK                                     0x8
#define _T1CLK_CS4_POSN                                     0x4
#define _T1CLK_CS4_POSITION                                 0x4
#define _T1CLK_CS4_SIZE                                     0x1
#define _T1CLK_CS4_LENGTH                                   0x1
#define _T1CLK_CS4_MASK                                     0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned CS                     :8;
    };
    struct {
        unsigned T1CS0                  :1;
        unsigned T1CS1                  :1;
        unsigned T1CS2                  :1;
        unsigned T1CS3                  :1;
        unsigned T1CS4                  :1;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
        unsigned CS4                    :1;
    };
} TMR1CLKbits_t;
extern volatile TMR1CLKbits_t TMR1CLKbits __at(0x311);
// bitfield macros
#define _TMR1CLK_CS_POSN                                    0x0
#define _TMR1CLK_CS_POSITION                                0x0
#define _TMR1CLK_CS_SIZE                                    0x8
#define _TMR1CLK_CS_LENGTH                                  0x8
#define _TMR1CLK_CS_MASK                                    0xFF
#define _TMR1CLK_T1CS0_POSN                                 0x0
#define _TMR1CLK_T1CS0_POSITION                             0x0
#define _TMR1CLK_T1CS0_SIZE                                 0x1
#define _TMR1CLK_T1CS0_LENGTH                               0x1
#define _TMR1CLK_T1CS0_MASK                                 0x1
#define _TMR1CLK_T1CS1_POSN                                 0x1
#define _TMR1CLK_T1CS1_POSITION                             0x1
#define _TMR1CLK_T1CS1_SIZE                                 0x1
#define _TMR1CLK_T1CS1_LENGTH                               0x1
#define _TMR1CLK_T1CS1_MASK                                 0x2
#define _TMR1CLK_T1CS2_POSN                                 0x2
#define _TMR1CLK_T1CS2_POSITION                             0x2
#define _TMR1CLK_T1CS2_SIZE                                 0x1
#define _TMR1CLK_T1CS2_LENGTH                               0x1
#define _TMR1CLK_T1CS2_MASK                                 0x4
#define _TMR1CLK_T1CS3_POSN                                 0x3
#define _TMR1CLK_T1CS3_POSITION                             0x3
#define _TMR1CLK_T1CS3_SIZE                                 0x1
#define _TMR1CLK_T1CS3_LENGTH                               0x1
#define _TMR1CLK_T1CS3_MASK                                 0x8
#define _TMR1CLK_T1CS4_POSN                                 0x4
#define _TMR1CLK_T1CS4_POSITION                             0x4
#define _TMR1CLK_T1CS4_SIZE                                 0x1
#define _TMR1CLK_T1CS4_LENGTH                               0x1
#define _TMR1CLK_T1CS4_MASK                                 0x10
#define _TMR1CLK_CS0_POSN                                   0x0
#define _TMR1CLK_CS0_POSITION                               0x0
#define _TMR1CLK_CS0_SIZE                                   0x1
#define _TMR1CLK_CS0_LENGTH                                 0x1
#define _TMR1CLK_CS0_MASK                                   0x1
#define _TMR1CLK_CS1_POSN                                   0x1
#define _TMR1CLK_CS1_POSITION                               0x1
#define _TMR1CLK_CS1_SIZE                                   0x1
#define _TMR1CLK_CS1_LENGTH                                 0x1
#define _TMR1CLK_CS1_MASK                                   0x2
#define _TMR1CLK_CS2_POSN                                   0x2
#define _TMR1CLK_CS2_POSITION                               0x2
#define _TMR1CLK_CS2_SIZE                                   0x1
#define _TMR1CLK_CS2_LENGTH                                 0x1
#define _TMR1CLK_CS2_MASK                                   0x4
#define _TMR1CLK_CS3_POSN                                   0x3
#define _TMR1CLK_CS3_POSITION                               0x3
#define _TMR1CLK_CS3_SIZE                                   0x1
#define _TMR1CLK_CS3_LENGTH                                 0x1
#define _TMR1CLK_CS3_MASK                                   0x8
#define _TMR1CLK_CS4_POSN                                   0x4
#define _TMR1CLK_CS4_POSITION                               0x4
#define _TMR1CLK_CS4_SIZE                                   0x1
#define _TMR1CLK_CS4_LENGTH                                 0x1
#define _TMR1CLK_CS4_MASK                                   0x10

// Register: TMR3
#define TMR3 TMR3
extern volatile unsigned short          TMR3                __at(0x312);
#ifndef _LIB_BUILD
asm("TMR3 equ 0312h");
#endif

// Register: TMR3L
#define TMR3L TMR3L
extern volatile unsigned char           TMR3L               __at(0x312);
#ifndef _LIB_BUILD
asm("TMR3L equ 0312h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR3L                  :8;
    };
    struct {
        unsigned TMR3L0                 :1;
        unsigned TMR3L1                 :1;
        unsigned TMR3L2                 :1;
        unsigned TMR3L3                 :1;
        unsigned TMR3L4                 :1;
        unsigned TMR3L5                 :1;
        unsigned TMR3L6                 :1;
        unsigned TMR3L7                 :1;
    };
    struct {
        unsigned TMR30                  :1;
        unsigned TMR31                  :1;
        unsigned TMR32                  :1;
        unsigned TMR33                  :1;
        unsigned TMR34                  :1;
        unsigned TMR35                  :1;
        unsigned TMR36                  :1;
        unsigned TMR37                  :1;
    };
    struct {
        unsigned CAL03                  :1;
        unsigned CAL13                  :1;
        unsigned CAL23                  :1;
        unsigned CAL33                  :1;
        unsigned CAL43                  :1;
        unsigned CAL53                  :1;
        unsigned CAL63                  :1;
        unsigned CAL73                  :1;
    };
} TMR3Lbits_t;
extern volatile TMR3Lbits_t TMR3Lbits __at(0x312);
// bitfield macros
#define _TMR3L_TMR3L_POSN                                   0x0
#define _TMR3L_TMR3L_POSITION                               0x0
#define _TMR3L_TMR3L_SIZE                                   0x8
#define _TMR3L_TMR3L_LENGTH                                 0x8
#define _TMR3L_TMR3L_MASK                                   0xFF
#define _TMR3L_TMR3L0_POSN                                  0x0
#define _TMR3L_TMR3L0_POSITION                              0x0
#define _TMR3L_TMR3L0_SIZE                                  0x1
#define _TMR3L_TMR3L0_LENGTH                                0x1
#define _TMR3L_TMR3L0_MASK                                  0x1
#define _TMR3L_TMR3L1_POSN                                  0x1
#define _TMR3L_TMR3L1_POSITION                              0x1
#define _TMR3L_TMR3L1_SIZE                                  0x1
#define _TMR3L_TMR3L1_LENGTH                                0x1
#define _TMR3L_TMR3L1_MASK                                  0x2
#define _TMR3L_TMR3L2_POSN                                  0x2
#define _TMR3L_TMR3L2_POSITION                              0x2
#define _TMR3L_TMR3L2_SIZE                                  0x1
#define _TMR3L_TMR3L2_LENGTH                                0x1
#define _TMR3L_TMR3L2_MASK                                  0x4
#define _TMR3L_TMR3L3_POSN                                  0x3
#define _TMR3L_TMR3L3_POSITION                              0x3
#define _TMR3L_TMR3L3_SIZE                                  0x1
#define _TMR3L_TMR3L3_LENGTH                                0x1
#define _TMR3L_TMR3L3_MASK                                  0x8
#define _TMR3L_TMR3L4_POSN                                  0x4
#define _TMR3L_TMR3L4_POSITION                              0x4
#define _TMR3L_TMR3L4_SIZE                                  0x1
#define _TMR3L_TMR3L4_LENGTH                                0x1
#define _TMR3L_TMR3L4_MASK                                  0x10
#define _TMR3L_TMR3L5_POSN                                  0x5
#define _TMR3L_TMR3L5_POSITION                              0x5
#define _TMR3L_TMR3L5_SIZE                                  0x1
#define _TMR3L_TMR3L5_LENGTH                                0x1
#define _TMR3L_TMR3L5_MASK                                  0x20
#define _TMR3L_TMR3L6_POSN                                  0x6
#define _TMR3L_TMR3L6_POSITION                              0x6
#define _TMR3L_TMR3L6_SIZE                                  0x1
#define _TMR3L_TMR3L6_LENGTH                                0x1
#define _TMR3L_TMR3L6_MASK                                  0x40
#define _TMR3L_TMR3L7_POSN                                  0x7
#define _TMR3L_TMR3L7_POSITION                              0x7
#define _TMR3L_TMR3L7_SIZE                                  0x1
#define _TMR3L_TMR3L7_LENGTH                                0x1
#define _TMR3L_TMR3L7_MASK                                  0x80
#define _TMR3L_TMR30_POSN                                   0x0
#define _TMR3L_TMR30_POSITION                               0x0
#define _TMR3L_TMR30_SIZE                                   0x1
#define _TMR3L_TMR30_LENGTH                                 0x1
#define _TMR3L_TMR30_MASK                                   0x1
#define _TMR3L_TMR31_POSN                                   0x1
#define _TMR3L_TMR31_POSITION                               0x1
#define _TMR3L_TMR31_SIZE                                   0x1
#define _TMR3L_TMR31_LENGTH                                 0x1
#define _TMR3L_TMR31_MASK                                   0x2
#define _TMR3L_TMR32_POSN                                   0x2
#define _TMR3L_TMR32_POSITION                               0x2
#define _TMR3L_TMR32_SIZE                                   0x1
#define _TMR3L_TMR32_LENGTH                                 0x1
#define _TMR3L_TMR32_MASK                                   0x4
#define _TMR3L_TMR33_POSN                                   0x3
#define _TMR3L_TMR33_POSITION                               0x3
#define _TMR3L_TMR33_SIZE                                   0x1
#define _TMR3L_TMR33_LENGTH                                 0x1
#define _TMR3L_TMR33_MASK                                   0x8
#define _TMR3L_TMR34_POSN                                   0x4
#define _TMR3L_TMR34_POSITION                               0x4
#define _TMR3L_TMR34_SIZE                                   0x1
#define _TMR3L_TMR34_LENGTH                                 0x1
#define _TMR3L_TMR34_MASK                                   0x10
#define _TMR3L_TMR35_POSN                                   0x5
#define _TMR3L_TMR35_POSITION                               0x5
#define _TMR3L_TMR35_SIZE                                   0x1
#define _TMR3L_TMR35_LENGTH                                 0x1
#define _TMR3L_TMR35_MASK                                   0x20
#define _TMR3L_TMR36_POSN                                   0x6
#define _TMR3L_TMR36_POSITION                               0x6
#define _TMR3L_TMR36_SIZE                                   0x1
#define _TMR3L_TMR36_LENGTH                                 0x1
#define _TMR3L_TMR36_MASK                                   0x40
#define _TMR3L_TMR37_POSN                                   0x7
#define _TMR3L_TMR37_POSITION                               0x7
#define _TMR3L_TMR37_SIZE                                   0x1
#define _TMR3L_TMR37_LENGTH                                 0x1
#define _TMR3L_TMR37_MASK                                   0x80
#define _TMR3L_CAL03_POSN                                   0x0
#define _TMR3L_CAL03_POSITION                               0x0
#define _TMR3L_CAL03_SIZE                                   0x1
#define _TMR3L_CAL03_LENGTH                                 0x1
#define _TMR3L_CAL03_MASK                                   0x1
#define _TMR3L_CAL13_POSN                                   0x1
#define _TMR3L_CAL13_POSITION                               0x1
#define _TMR3L_CAL13_SIZE                                   0x1
#define _TMR3L_CAL13_LENGTH                                 0x1
#define _TMR3L_CAL13_MASK                                   0x2
#define _TMR3L_CAL23_POSN                                   0x2
#define _TMR3L_CAL23_POSITION                               0x2
#define _TMR3L_CAL23_SIZE                                   0x1
#define _TMR3L_CAL23_LENGTH                                 0x1
#define _TMR3L_CAL23_MASK                                   0x4
#define _TMR3L_CAL33_POSN                                   0x3
#define _TMR3L_CAL33_POSITION                               0x3
#define _TMR3L_CAL33_SIZE                                   0x1
#define _TMR3L_CAL33_LENGTH                                 0x1
#define _TMR3L_CAL33_MASK                                   0x8
#define _TMR3L_CAL43_POSN                                   0x4
#define _TMR3L_CAL43_POSITION                               0x4
#define _TMR3L_CAL43_SIZE                                   0x1
#define _TMR3L_CAL43_LENGTH                                 0x1
#define _TMR3L_CAL43_MASK                                   0x10
#define _TMR3L_CAL53_POSN                                   0x5
#define _TMR3L_CAL53_POSITION                               0x5
#define _TMR3L_CAL53_SIZE                                   0x1
#define _TMR3L_CAL53_LENGTH                                 0x1
#define _TMR3L_CAL53_MASK                                   0x20
#define _TMR3L_CAL63_POSN                                   0x6
#define _TMR3L_CAL63_POSITION                               0x6
#define _TMR3L_CAL63_SIZE                                   0x1
#define _TMR3L_CAL63_LENGTH                                 0x1
#define _TMR3L_CAL63_MASK                                   0x40
#define _TMR3L_CAL73_POSN                                   0x7
#define _TMR3L_CAL73_POSITION                               0x7
#define _TMR3L_CAL73_SIZE                                   0x1
#define _TMR3L_CAL73_LENGTH                                 0x1
#define _TMR3L_CAL73_MASK                                   0x80

