GopalSaraf/Practicals/PSDL/include/proc/pic16f17144.h
// Register: CLCnCON
#define CLCnCON CLCnCON
extern volatile unsigned char           CLCnCON             __at(0x68C);
#ifndef _LIB_BUILD
asm("CLCnCON equ 068Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned INTN                   :1;
        unsigned INTP                   :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
} CLCnCONbits_t;
extern volatile CLCnCONbits_t CLCnCONbits __at(0x68C);
// bitfield macros
#define _CLCnCON_MODE_POSN                                  0x0
#define _CLCnCON_MODE_POSITION                              0x0
#define _CLCnCON_MODE_SIZE                                  0x3
#define _CLCnCON_MODE_LENGTH                                0x3
#define _CLCnCON_MODE_MASK                                  0x7
#define _CLCnCON_INTN_POSN                                  0x3
#define _CLCnCON_INTN_POSITION                              0x3
#define _CLCnCON_INTN_SIZE                                  0x1
#define _CLCnCON_INTN_LENGTH                                0x1
#define _CLCnCON_INTN_MASK                                  0x8
#define _CLCnCON_INTP_POSN                                  0x4
#define _CLCnCON_INTP_POSITION                              0x4
#define _CLCnCON_INTP_SIZE                                  0x1
#define _CLCnCON_INTP_LENGTH                                0x1
#define _CLCnCON_INTP_MASK                                  0x10
#define _CLCnCON_OUT_POSN                                   0x5
#define _CLCnCON_OUT_POSITION                               0x5
#define _CLCnCON_OUT_SIZE                                   0x1
#define _CLCnCON_OUT_LENGTH                                 0x1
#define _CLCnCON_OUT_MASK                                   0x20
#define _CLCnCON_EN_POSN                                    0x7
#define _CLCnCON_EN_POSITION                                0x7
#define _CLCnCON_EN_SIZE                                    0x1
#define _CLCnCON_EN_LENGTH                                  0x1
#define _CLCnCON_EN_MASK                                    0x80
#define _CLCnCON_MODE0_POSN                                 0x0
#define _CLCnCON_MODE0_POSITION                             0x0
#define _CLCnCON_MODE0_SIZE                                 0x1
#define _CLCnCON_MODE0_LENGTH                               0x1
#define _CLCnCON_MODE0_MASK                                 0x1
#define _CLCnCON_MODE1_POSN                                 0x1
#define _CLCnCON_MODE1_POSITION                             0x1
#define _CLCnCON_MODE1_SIZE                                 0x1
#define _CLCnCON_MODE1_LENGTH                               0x1
#define _CLCnCON_MODE1_MASK                                 0x2
#define _CLCnCON_MODE2_POSN                                 0x2
#define _CLCnCON_MODE2_POSITION                             0x2
#define _CLCnCON_MODE2_SIZE                                 0x1
#define _CLCnCON_MODE2_LENGTH                               0x1
#define _CLCnCON_MODE2_MASK                                 0x4

// Register: CLCnPOL
#define CLCnPOL CLCnPOL
extern volatile unsigned char           CLCnPOL             __at(0x68D);
#ifndef _LIB_BUILD
asm("CLCnPOL equ 068Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1POL                  :1;
        unsigned G2POL                  :1;
        unsigned G3POL                  :1;
        unsigned G4POL                  :1;
        unsigned                        :3;
        unsigned POL                    :1;
    };
} CLCnPOLbits_t;
extern volatile CLCnPOLbits_t CLCnPOLbits __at(0x68D);
// bitfield macros
#define _CLCnPOL_G1POL_POSN                                 0x0
#define _CLCnPOL_G1POL_POSITION                             0x0
#define _CLCnPOL_G1POL_SIZE                                 0x1
#define _CLCnPOL_G1POL_LENGTH                               0x1
#define _CLCnPOL_G1POL_MASK                                 0x1
#define _CLCnPOL_G2POL_POSN                                 0x1
#define _CLCnPOL_G2POL_POSITION                             0x1
#define _CLCnPOL_G2POL_SIZE                                 0x1
#define _CLCnPOL_G2POL_LENGTH                               0x1
#define _CLCnPOL_G2POL_MASK                                 0x2
#define _CLCnPOL_G3POL_POSN                                 0x2
#define _CLCnPOL_G3POL_POSITION                             0x2
#define _CLCnPOL_G3POL_SIZE                                 0x1
#define _CLCnPOL_G3POL_LENGTH                               0x1
#define _CLCnPOL_G3POL_MASK                                 0x4
#define _CLCnPOL_G4POL_POSN                                 0x3
#define _CLCnPOL_G4POL_POSITION                             0x3
#define _CLCnPOL_G4POL_SIZE                                 0x1
#define _CLCnPOL_G4POL_LENGTH                               0x1
#define _CLCnPOL_G4POL_MASK                                 0x8
#define _CLCnPOL_POL_POSN                                   0x7
#define _CLCnPOL_POL_POSITION                               0x7
#define _CLCnPOL_POL_SIZE                                   0x1
#define _CLCnPOL_POL_LENGTH                                 0x1
#define _CLCnPOL_POL_MASK                                   0x80

// Register: CLCnSEL0
#define CLCnSEL0 CLCnSEL0
extern volatile unsigned char           CLCnSEL0            __at(0x68E);
#ifndef _LIB_BUILD
asm("CLCnSEL0 equ 068Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D1S                    :8;
    };
    struct {
        unsigned D1S0                   :1;
        unsigned D1S1                   :1;
        unsigned D1S2                   :1;
        unsigned D1S3                   :1;
        unsigned D1S4                   :1;
        unsigned D1S5                   :1;
        unsigned D1S6                   :1;
    };
} CLCnSEL0bits_t;
extern volatile CLCnSEL0bits_t CLCnSEL0bits __at(0x68E);
// bitfield macros
#define _CLCnSEL0_D1S_POSN                                  0x0
#define _CLCnSEL0_D1S_POSITION                              0x0
#define _CLCnSEL0_D1S_SIZE                                  0x8
#define _CLCnSEL0_D1S_LENGTH                                0x8
#define _CLCnSEL0_D1S_MASK                                  0xFF
#define _CLCnSEL0_D1S0_POSN                                 0x0
#define _CLCnSEL0_D1S0_POSITION                             0x0
#define _CLCnSEL0_D1S0_SIZE                                 0x1
#define _CLCnSEL0_D1S0_LENGTH                               0x1
#define _CLCnSEL0_D1S0_MASK                                 0x1
#define _CLCnSEL0_D1S1_POSN                                 0x1
#define _CLCnSEL0_D1S1_POSITION                             0x1
#define _CLCnSEL0_D1S1_SIZE                                 0x1
#define _CLCnSEL0_D1S1_LENGTH                               0x1
#define _CLCnSEL0_D1S1_MASK                                 0x2
#define _CLCnSEL0_D1S2_POSN                                 0x2
#define _CLCnSEL0_D1S2_POSITION                             0x2
#define _CLCnSEL0_D1S2_SIZE                                 0x1
#define _CLCnSEL0_D1S2_LENGTH                               0x1
#define _CLCnSEL0_D1S2_MASK                                 0x4
#define _CLCnSEL0_D1S3_POSN                                 0x3
#define _CLCnSEL0_D1S3_POSITION                             0x3
#define _CLCnSEL0_D1S3_SIZE                                 0x1
#define _CLCnSEL0_D1S3_LENGTH                               0x1
#define _CLCnSEL0_D1S3_MASK                                 0x8
#define _CLCnSEL0_D1S4_POSN                                 0x4
#define _CLCnSEL0_D1S4_POSITION                             0x4
#define _CLCnSEL0_D1S4_SIZE                                 0x1
#define _CLCnSEL0_D1S4_LENGTH                               0x1
#define _CLCnSEL0_D1S4_MASK                                 0x10
#define _CLCnSEL0_D1S5_POSN                                 0x5
#define _CLCnSEL0_D1S5_POSITION                             0x5
#define _CLCnSEL0_D1S5_SIZE                                 0x1
#define _CLCnSEL0_D1S5_LENGTH                               0x1
#define _CLCnSEL0_D1S5_MASK                                 0x20
#define _CLCnSEL0_D1S6_POSN                                 0x6
#define _CLCnSEL0_D1S6_POSITION                             0x6
#define _CLCnSEL0_D1S6_SIZE                                 0x1
#define _CLCnSEL0_D1S6_LENGTH                               0x1
#define _CLCnSEL0_D1S6_MASK                                 0x40

// Register: CLCnSEL1
#define CLCnSEL1 CLCnSEL1
extern volatile unsigned char           CLCnSEL1            __at(0x68F);
#ifndef _LIB_BUILD
asm("CLCnSEL1 equ 068Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D2S                    :8;
    };
    struct {
        unsigned D2S0                   :1;
        unsigned D2S1                   :1;
        unsigned D2S2                   :1;
        unsigned D2S3                   :1;
        unsigned D2S4                   :1;
        unsigned D2S5                   :1;
        unsigned D2S6                   :1;
    };
} CLCnSEL1bits_t;
extern volatile CLCnSEL1bits_t CLCnSEL1bits __at(0x68F);
// bitfield macros
#define _CLCnSEL1_D2S_POSN                                  0x0
#define _CLCnSEL1_D2S_POSITION                              0x0
#define _CLCnSEL1_D2S_SIZE                                  0x8
#define _CLCnSEL1_D2S_LENGTH                                0x8
#define _CLCnSEL1_D2S_MASK                                  0xFF
#define _CLCnSEL1_D2S0_POSN                                 0x0
#define _CLCnSEL1_D2S0_POSITION                             0x0
#define _CLCnSEL1_D2S0_SIZE                                 0x1
#define _CLCnSEL1_D2S0_LENGTH                               0x1
#define _CLCnSEL1_D2S0_MASK                                 0x1
#define _CLCnSEL1_D2S1_POSN                                 0x1
#define _CLCnSEL1_D2S1_POSITION                             0x1
#define _CLCnSEL1_D2S1_SIZE                                 0x1
#define _CLCnSEL1_D2S1_LENGTH                               0x1
#define _CLCnSEL1_D2S1_MASK                                 0x2
#define _CLCnSEL1_D2S2_POSN                                 0x2
#define _CLCnSEL1_D2S2_POSITION                             0x2
#define _CLCnSEL1_D2S2_SIZE                                 0x1
#define _CLCnSEL1_D2S2_LENGTH                               0x1
#define _CLCnSEL1_D2S2_MASK                                 0x4
#define _CLCnSEL1_D2S3_POSN                                 0x3
#define _CLCnSEL1_D2S3_POSITION                             0x3
#define _CLCnSEL1_D2S3_SIZE                                 0x1
#define _CLCnSEL1_D2S3_LENGTH                               0x1
#define _CLCnSEL1_D2S3_MASK                                 0x8
#define _CLCnSEL1_D2S4_POSN                                 0x4
#define _CLCnSEL1_D2S4_POSITION                             0x4
#define _CLCnSEL1_D2S4_SIZE                                 0x1
#define _CLCnSEL1_D2S4_LENGTH                               0x1
#define _CLCnSEL1_D2S4_MASK                                 0x10
#define _CLCnSEL1_D2S5_POSN                                 0x5
#define _CLCnSEL1_D2S5_POSITION                             0x5
#define _CLCnSEL1_D2S5_SIZE                                 0x1
#define _CLCnSEL1_D2S5_LENGTH                               0x1
#define _CLCnSEL1_D2S5_MASK                                 0x20
#define _CLCnSEL1_D2S6_POSN                                 0x6
#define _CLCnSEL1_D2S6_POSITION                             0x6
#define _CLCnSEL1_D2S6_SIZE                                 0x1
#define _CLCnSEL1_D2S6_LENGTH                               0x1
#define _CLCnSEL1_D2S6_MASK                                 0x40

// Register: CLCnSEL2
#define CLCnSEL2 CLCnSEL2
extern volatile unsigned char           CLCnSEL2            __at(0x690);
#ifndef _LIB_BUILD
asm("CLCnSEL2 equ 0690h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D3S                    :8;
    };
    struct {
        unsigned D3S0                   :1;
        unsigned D3S1                   :1;
        unsigned D3S2                   :1;
        unsigned D3S3                   :1;
        unsigned D3S4                   :1;
        unsigned D3S5                   :1;
        unsigned D3S6                   :1;
    };
} CLCnSEL2bits_t;
extern volatile CLCnSEL2bits_t CLCnSEL2bits __at(0x690);
// bitfield macros
#define _CLCnSEL2_D3S_POSN                                  0x0
#define _CLCnSEL2_D3S_POSITION                              0x0
#define _CLCnSEL2_D3S_SIZE                                  0x8
#define _CLCnSEL2_D3S_LENGTH                                0x8
#define _CLCnSEL2_D3S_MASK                                  0xFF
#define _CLCnSEL2_D3S0_POSN                                 0x0
#define _CLCnSEL2_D3S0_POSITION                             0x0
#define _CLCnSEL2_D3S0_SIZE                                 0x1
#define _CLCnSEL2_D3S0_LENGTH                               0x1
#define _CLCnSEL2_D3S0_MASK                                 0x1
#define _CLCnSEL2_D3S1_POSN                                 0x1
#define _CLCnSEL2_D3S1_POSITION                             0x1
#define _CLCnSEL2_D3S1_SIZE                                 0x1
#define _CLCnSEL2_D3S1_LENGTH                               0x1
#define _CLCnSEL2_D3S1_MASK                                 0x2
#define _CLCnSEL2_D3S2_POSN                                 0x2
#define _CLCnSEL2_D3S2_POSITION                             0x2
#define _CLCnSEL2_D3S2_SIZE                                 0x1
#define _CLCnSEL2_D3S2_LENGTH                               0x1
#define _CLCnSEL2_D3S2_MASK                                 0x4
#define _CLCnSEL2_D3S3_POSN                                 0x3
#define _CLCnSEL2_D3S3_POSITION                             0x3
#define _CLCnSEL2_D3S3_SIZE                                 0x1
#define _CLCnSEL2_D3S3_LENGTH                               0x1
#define _CLCnSEL2_D3S3_MASK                                 0x8
#define _CLCnSEL2_D3S4_POSN                                 0x4
#define _CLCnSEL2_D3S4_POSITION                             0x4
#define _CLCnSEL2_D3S4_SIZE                                 0x1
#define _CLCnSEL2_D3S4_LENGTH                               0x1
#define _CLCnSEL2_D3S4_MASK                                 0x10
#define _CLCnSEL2_D3S5_POSN                                 0x5
#define _CLCnSEL2_D3S5_POSITION                             0x5
#define _CLCnSEL2_D3S5_SIZE                                 0x1
#define _CLCnSEL2_D3S5_LENGTH                               0x1
#define _CLCnSEL2_D3S5_MASK                                 0x20
#define _CLCnSEL2_D3S6_POSN                                 0x6
#define _CLCnSEL2_D3S6_POSITION                             0x6
#define _CLCnSEL2_D3S6_SIZE                                 0x1
#define _CLCnSEL2_D3S6_LENGTH                               0x1
#define _CLCnSEL2_D3S6_MASK                                 0x40

// Register: CLCnSEL3
#define CLCnSEL3 CLCnSEL3
extern volatile unsigned char           CLCnSEL3            __at(0x691);
#ifndef _LIB_BUILD
asm("CLCnSEL3 equ 0691h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D4S                    :8;
    };
    struct {
        unsigned D4S0                   :1;
        unsigned D4S1                   :1;
        unsigned D4S2                   :1;
        unsigned D4S3                   :1;
        unsigned D4S4                   :1;
        unsigned D4S5                   :1;
        unsigned D4S6                   :1;
    };
} CLCnSEL3bits_t;
extern volatile CLCnSEL3bits_t CLCnSEL3bits __at(0x691);
// bitfield macros
#define _CLCnSEL3_D4S_POSN                                  0x0
#define _CLCnSEL3_D4S_POSITION                              0x0
#define _CLCnSEL3_D4S_SIZE                                  0x8
#define _CLCnSEL3_D4S_LENGTH                                0x8
#define _CLCnSEL3_D4S_MASK                                  0xFF
#define _CLCnSEL3_D4S0_POSN                                 0x0
#define _CLCnSEL3_D4S0_POSITION                             0x0
#define _CLCnSEL3_D4S0_SIZE                                 0x1
#define _CLCnSEL3_D4S0_LENGTH                               0x1
#define _CLCnSEL3_D4S0_MASK                                 0x1
#define _CLCnSEL3_D4S1_POSN                                 0x1
#define _CLCnSEL3_D4S1_POSITION                             0x1
#define _CLCnSEL3_D4S1_SIZE                                 0x1
#define _CLCnSEL3_D4S1_LENGTH                               0x1
#define _CLCnSEL3_D4S1_MASK                                 0x2
#define _CLCnSEL3_D4S2_POSN                                 0x2
#define _CLCnSEL3_D4S2_POSITION                             0x2
#define _CLCnSEL3_D4S2_SIZE                                 0x1
#define _CLCnSEL3_D4S2_LENGTH                               0x1
#define _CLCnSEL3_D4S2_MASK                                 0x4
#define _CLCnSEL3_D4S3_POSN                                 0x3
#define _CLCnSEL3_D4S3_POSITION                             0x3
#define _CLCnSEL3_D4S3_SIZE                                 0x1
#define _CLCnSEL3_D4S3_LENGTH                               0x1
#define _CLCnSEL3_D4S3_MASK                                 0x8
#define _CLCnSEL3_D4S4_POSN                                 0x4
#define _CLCnSEL3_D4S4_POSITION                             0x4
#define _CLCnSEL3_D4S4_SIZE                                 0x1
#define _CLCnSEL3_D4S4_LENGTH                               0x1
#define _CLCnSEL3_D4S4_MASK                                 0x10
#define _CLCnSEL3_D4S5_POSN                                 0x5
#define _CLCnSEL3_D4S5_POSITION                             0x5
#define _CLCnSEL3_D4S5_SIZE                                 0x1
#define _CLCnSEL3_D4S5_LENGTH                               0x1
#define _CLCnSEL3_D4S5_MASK                                 0x20
#define _CLCnSEL3_D4S6_POSN                                 0x6
#define _CLCnSEL3_D4S6_POSITION                             0x6
#define _CLCnSEL3_D4S6_SIZE                                 0x1
#define _CLCnSEL3_D4S6_LENGTH                               0x1
#define _CLCnSEL3_D4S6_MASK                                 0x40

// Register: CLCnGLS0
#define CLCnGLS0 CLCnGLS0
extern volatile unsigned char           CLCnGLS0            __at(0x692);
#ifndef _LIB_BUILD
asm("CLCnGLS0 equ 0692h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1D1N                  :1;
        unsigned G1D1T                  :1;
        unsigned G1D2N                  :1;
        unsigned G1D2T                  :1;
        unsigned G1D3N                  :1;
        unsigned G1D3T                  :1;
        unsigned G1D4N                  :1;
        unsigned G1D4T                  :1;
    };
} CLCnGLS0bits_t;
