GopalSaraf/Practicals/PSDL/include/proc/pic16f17144.h
extern volatile __bit                   WDTWINDOW2          __at(0xC6A);	// @ (0x18D * 8 + 2)
#define                                 WDTWINDOW2_bit      _BIT_ACCESS(WDTCON1,2)
// WDTCON1<WINDOW0>
extern volatile __bit                   WINDOW0             __at(0xC68);	// @ (0x18D * 8 + 0)
#define                                 WINDOW0_bit         _BIT_ACCESS(WDTCON1,0)
// WDTCON1<WINDOW1>
extern volatile __bit                   WINDOW1             __at(0xC69);	// @ (0x18D * 8 + 1)
#define                                 WINDOW1_bit         _BIT_ACCESS(WDTCON1,1)
// WDTCON1<WINDOW2>
extern volatile __bit                   WINDOW2             __at(0xC6A);	// @ (0x18D * 8 + 2)
#define                                 WINDOW2_bit         _BIT_ACCESS(WDTCON1,2)
// WPUA<WPUA0>
extern volatile __bit                   WPUA0               __at(0xF468);	// @ (0x1E8D * 8 + 0)
#define                                 WPUA0_bit           _BIT_ACCESS(WPUA,0)
// WPUA<WPUA1>
extern volatile __bit                   WPUA1               __at(0xF469);	// @ (0x1E8D * 8 + 1)
#define                                 WPUA1_bit           _BIT_ACCESS(WPUA,1)
// WPUA<WPUA2>
extern volatile __bit                   WPUA2               __at(0xF46A);	// @ (0x1E8D * 8 + 2)
#define                                 WPUA2_bit           _BIT_ACCESS(WPUA,2)
// WPUA<WPUA3>
extern volatile __bit                   WPUA3               __at(0xF46B);	// @ (0x1E8D * 8 + 3)
#define                                 WPUA3_bit           _BIT_ACCESS(WPUA,3)
// WPUA<WPUA4>
extern volatile __bit                   WPUA4               __at(0xF46C);	// @ (0x1E8D * 8 + 4)
#define                                 WPUA4_bit           _BIT_ACCESS(WPUA,4)
// WPUA<WPUA5>
extern volatile __bit                   WPUA5               __at(0xF46D);	// @ (0x1E8D * 8 + 5)
#define                                 WPUA5_bit           _BIT_ACCESS(WPUA,5)
// WPUB<WPUB4>
extern volatile __bit                   WPUB4               __at(0xF4BC);	// @ (0x1E97 * 8 + 4)
#define                                 WPUB4_bit           _BIT_ACCESS(WPUB,4)
// WPUB<WPUB5>
extern volatile __bit                   WPUB5               __at(0xF4BD);	// @ (0x1E97 * 8 + 5)
#define                                 WPUB5_bit           _BIT_ACCESS(WPUB,5)
// WPUB<WPUB6>
extern volatile __bit                   WPUB6               __at(0xF4BE);	// @ (0x1E97 * 8 + 6)
#define                                 WPUB6_bit           _BIT_ACCESS(WPUB,6)
// WPUB<WPUB7>
extern volatile __bit                   WPUB7               __at(0xF4BF);	// @ (0x1E97 * 8 + 7)
#define                                 WPUB7_bit           _BIT_ACCESS(WPUB,7)
// WPUC<WPUC0>
extern volatile __bit                   WPUC0               __at(0xF508);	// @ (0x1EA1 * 8 + 0)
#define                                 WPUC0_bit           _BIT_ACCESS(WPUC,0)
// WPUC<WPUC1>
extern volatile __bit                   WPUC1               __at(0xF509);	// @ (0x1EA1 * 8 + 1)
#define                                 WPUC1_bit           _BIT_ACCESS(WPUC,1)
// WPUC<WPUC2>
extern volatile __bit                   WPUC2               __at(0xF50A);	// @ (0x1EA1 * 8 + 2)
#define                                 WPUC2_bit           _BIT_ACCESS(WPUC,2)
// WPUC<WPUC3>
extern volatile __bit                   WPUC3               __at(0xF50B);	// @ (0x1EA1 * 8 + 3)
#define                                 WPUC3_bit           _BIT_ACCESS(WPUC,3)
// WPUC<WPUC4>
extern volatile __bit                   WPUC4               __at(0xF50C);	// @ (0x1EA1 * 8 + 4)
#define                                 WPUC4_bit           _BIT_ACCESS(WPUC,4)
// WPUC<WPUC5>
extern volatile __bit                   WPUC5               __at(0xF50D);	// @ (0x1EA1 * 8 + 5)
#define                                 WPUC5_bit           _BIT_ACCESS(WPUC,5)
// WPUC<WPUC6>
extern volatile __bit                   WPUC6               __at(0xF50E);	// @ (0x1EA1 * 8 + 6)
#define                                 WPUC6_bit           _BIT_ACCESS(WPUC,6)
// WPUC<WPUC7>
extern volatile __bit                   WPUC7               __at(0xF50F);	// @ (0x1EA1 * 8 + 7)
#define                                 WPUC7_bit           _BIT_ACCESS(WPUC,7)
// NVMCON1<WR>
extern volatile __bit                   WR                  __at(0xE481);	// @ (0x1C90 * 8 + 1)
#define                                 WR_bit              _BIT_ACCESS(NVMCON1,1)
// NVMCON1<WREN>
extern volatile __bit                   WREN                __at(0xE482);	// @ (0x1C90 * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(NVMCON1,2)
// NVMCON1<WRERR>
extern volatile __bit                   WRERR               __at(0xE483);	// @ (0x1C90 * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(NVMCON1,3)
// CRCXORL<XOR0>
extern volatile __bit                   XOR0                __at(0xE4F0);	// @ (0x1C9E * 8 + 0)
#define                                 XOR0_bit            _BIT_ACCESS(CRCXORL,0)
// CRCXORL<XOR1>
extern volatile __bit                   XOR1                __at(0xE4F1);	// @ (0x1C9E * 8 + 1)
#define                                 XOR1_bit            _BIT_ACCESS(CRCXORL,1)
// CRCXORH<XOR10>
extern volatile __bit                   XOR10               __at(0xE4FA);	// @ (0x1C9F * 8 + 2)
#define                                 XOR10_bit           _BIT_ACCESS(CRCXORH,2)
// CRCXORH<XOR11>
extern volatile __bit                   XOR11               __at(0xE4FB);	// @ (0x1C9F * 8 + 3)
#define                                 XOR11_bit           _BIT_ACCESS(CRCXORH,3)
// CRCXORH<XOR12>
extern volatile __bit                   XOR12               __at(0xE4FC);	// @ (0x1C9F * 8 + 4)
#define                                 XOR12_bit           _BIT_ACCESS(CRCXORH,4)
// CRCXORH<XOR13>
extern volatile __bit                   XOR13               __at(0xE4FD);	// @ (0x1C9F * 8 + 5)
#define                                 XOR13_bit           _BIT_ACCESS(CRCXORH,5)
// CRCXORH<XOR14>
extern volatile __bit                   XOR14               __at(0xE4FE);	// @ (0x1C9F * 8 + 6)
#define                                 XOR14_bit           _BIT_ACCESS(CRCXORH,6)
// CRCXORH<XOR15>
extern volatile __bit                   XOR15               __at(0xE4FF);	// @ (0x1C9F * 8 + 7)
#define                                 XOR15_bit           _BIT_ACCESS(CRCXORH,7)
// CRCXORU<XOR16>
extern volatile __bit                   XOR16               __at(0xE500);	// @ (0x1CA0 * 8 + 0)
#define                                 XOR16_bit           _BIT_ACCESS(CRCXORU,0)
// CRCXORU<XOR17>
extern volatile __bit                   XOR17               __at(0xE501);	// @ (0x1CA0 * 8 + 1)
#define                                 XOR17_bit           _BIT_ACCESS(CRCXORU,1)
// CRCXORU<XOR18>
extern volatile __bit                   XOR18               __at(0xE502);	// @ (0x1CA0 * 8 + 2)
#define                                 XOR18_bit           _BIT_ACCESS(CRCXORU,2)
// CRCXORU<XOR19>
extern volatile __bit                   XOR19               __at(0xE503);	// @ (0x1CA0 * 8 + 3)
#define                                 XOR19_bit           _BIT_ACCESS(CRCXORU,3)
// CRCXORL<XOR2>
extern volatile __bit                   XOR2                __at(0xE4F2);	// @ (0x1C9E * 8 + 2)
#define                                 XOR2_bit            _BIT_ACCESS(CRCXORL,2)
// CRCXORU<XOR20>
extern volatile __bit                   XOR20               __at(0xE504);	// @ (0x1CA0 * 8 + 4)
#define                                 XOR20_bit           _BIT_ACCESS(CRCXORU,4)
// CRCXORU<XOR21>
extern volatile __bit                   XOR21               __at(0xE505);	// @ (0x1CA0 * 8 + 5)
#define                                 XOR21_bit           _BIT_ACCESS(CRCXORU,5)
// CRCXORU<XOR22>
extern volatile __bit                   XOR22               __at(0xE506);	// @ (0x1CA0 * 8 + 6)
#define                                 XOR22_bit           _BIT_ACCESS(CRCXORU,6)
// CRCXORU<XOR23>
extern volatile __bit                   XOR23               __at(0xE507);	// @ (0x1CA0 * 8 + 7)
#define                                 XOR23_bit           _BIT_ACCESS(CRCXORU,7)
// CRCXORT<XOR24>
extern volatile __bit                   XOR24               __at(0xE508);	// @ (0x1CA1 * 8 + 0)
#define                                 XOR24_bit           _BIT_ACCESS(CRCXORT,0)
// CRCXORT<XOR25>
extern volatile __bit                   XOR25               __at(0xE509);	// @ (0x1CA1 * 8 + 1)
#define                                 XOR25_bit           _BIT_ACCESS(CRCXORT,1)
// CRCXORT<XOR26>
extern volatile __bit                   XOR26               __at(0xE50A);	// @ (0x1CA1 * 8 + 2)
#define                                 XOR26_bit           _BIT_ACCESS(CRCXORT,2)
// CRCXORT<XOR27>
extern volatile __bit                   XOR27               __at(0xE50B);	// @ (0x1CA1 * 8 + 3)
#define                                 XOR27_bit           _BIT_ACCESS(CRCXORT,3)
// CRCXORT<XOR28>
extern volatile __bit                   XOR28               __at(0xE50C);	// @ (0x1CA1 * 8 + 4)
#define                                 XOR28_bit           _BIT_ACCESS(CRCXORT,4)
// CRCXORT<XOR29>
extern volatile __bit                   XOR29               __at(0xE50D);	// @ (0x1CA1 * 8 + 5)
#define                                 XOR29_bit           _BIT_ACCESS(CRCXORT,5)
// CRCXORL<XOR3>
extern volatile __bit                   XOR3                __at(0xE4F3);	// @ (0x1C9E * 8 + 3)
#define                                 XOR3_bit            _BIT_ACCESS(CRCXORL,3)
// CRCXORT<XOR30>
extern volatile __bit                   XOR30               __at(0xE50E);	// @ (0x1CA1 * 8 + 6)
#define                                 XOR30_bit           _BIT_ACCESS(CRCXORT,6)
// CRCXORT<XOR31>
extern volatile __bit                   XOR31               __at(0xE50F);	// @ (0x1CA1 * 8 + 7)
#define                                 XOR31_bit           _BIT_ACCESS(CRCXORT,7)
// CRCXORL<XOR4>
extern volatile __bit                   XOR4                __at(0xE4F4);	// @ (0x1C9E * 8 + 4)
#define                                 XOR4_bit            _BIT_ACCESS(CRCXORL,4)
// CRCXORL<XOR5>
extern volatile __bit                   XOR5                __at(0xE4F5);	// @ (0x1C9E * 8 + 5)
#define                                 XOR5_bit            _BIT_ACCESS(CRCXORL,5)
// CRCXORL<XOR6>
extern volatile __bit                   XOR6                __at(0xE4F6);	// @ (0x1C9E * 8 + 6)
#define                                 XOR6_bit            _BIT_ACCESS(CRCXORL,6)
// CRCXORL<XOR7>
extern volatile __bit                   XOR7                __at(0xE4F7);	// @ (0x1C9E * 8 + 7)
#define                                 XOR7_bit            _BIT_ACCESS(CRCXORL,7)
// CRCXORH<XOR8>
extern volatile __bit                   XOR8                __at(0xE4F8);	// @ (0x1C9F * 8 + 0)
#define                                 XOR8_bit            _BIT_ACCESS(CRCXORH,0)
// CRCXORH<XOR9>
extern volatile __bit                   XOR9                __at(0xE4F9);	// @ (0x1C9F * 8 + 1)
#define                                 XOR9_bit            _BIT_ACCESS(CRCXORH,1)
// PIE6<ZCDIE>
extern volatile __bit                   ZCDIE               __at(0x4E2);	// @ (0x9C * 8 + 2)
#define                                 ZCDIE_bit           _BIT_ACCESS(PIE6,2)
// PIR6<ZCDIF>
extern volatile __bit                   ZCDIF               __at(0x492);	// @ (0x92 * 8 + 2)
#define                                 ZCDIF_bit           _BIT_ACCESS(PIR6,2)
// ZCDCON<ZCDINTN>
extern volatile __bit                   ZCDINTN             __at(0x10F8);	// @ (0x21F * 8 + 0)
#define                                 ZCDINTN_bit         _BIT_ACCESS(ZCDCON,0)
// ZCDCON<ZCDINTP>
extern volatile __bit                   ZCDINTP             __at(0x10F9);	// @ (0x21F * 8 + 1)
#define                                 ZCDINTP_bit         _BIT_ACCESS(ZCDCON,1)
// PMD4<ZCDMD>
extern volatile __bit                   ZCDMD               __at(0x884);	// @ (0x110 * 8 + 4)
#define                                 ZCDMD_bit           _BIT_ACCESS(PMD4,4)
// ZCDCON<ZCDOUT>
extern volatile __bit                   ZCDOUT              __at(0x10FD);	// @ (0x21F * 8 + 5)
#define                                 ZCDOUT_bit          _BIT_ACCESS(ZCDCON,5)
// ZCDCON<ZCDPOL>
extern volatile __bit                   ZCDPOL              __at(0x10FC);	// @ (0x21F * 8 + 4)
#define                                 ZCDPOL_bit          _BIT_ACCESS(ZCDCON,4)
// ZCDCON<ZCDSEN>
extern volatile __bit                   ZCDSEN              __at(0x10FF);	// @ (0x21F * 8 + 7)
#define                                 ZCDSEN_bit          _BIT_ACCESS(ZCDCON,7)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x1A);	// @ (0x3 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// SSP1STAT<nADDRESS1>
extern volatile __bit                   nADDRESS1           __at(0x3C7D);	// @ (0x78F * 8 + 5)
#define                                 nADDRESS1_bit       _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<nADDRESS2>
extern volatile __bit                   nADDRESS2           __at(0x3CCD);	// @ (0x799 * 8 + 5)
#define                                 nADDRESS2_bit       _BIT_ACCESS(SSP2STAT,5)
// PCON0<nBOR>
extern volatile __bit                   nBOR                __at(0xC90);	// @ (0x192 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(PCON0,0)
// PCON1<nMEMV>
extern volatile __bit                   nMEMV               __at(0xC99);	// @ (0x193 * 8 + 1)
#define                                 nMEMV_bit           _BIT_ACCESS(PCON1,1)
// STATUS<nPD>
extern volatile __bit                   nPD                 __at(0x1B);	// @ (0x3 * 8 + 3)
#define                                 nPD_bit             _BIT_ACCESS(STATUS,3)
// PCON0<nPOR>
extern volatile __bit                   nPOR                __at(0xC91);	// @ (0x192 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(PCON0,1)
// PCON0<nRI>
extern volatile __bit                   nRI                 __at(0xC92);	// @ (0x192 * 8 + 2)
#define                                 nRI_bit             _BIT_ACCESS(PCON0,2)
// PCON0<nRMCLR>
extern volatile __bit                   nRMCLR              __at(0xC93);	// @ (0x192 * 8 + 3)
#define                                 nRMCLR_bit          _BIT_ACCESS(PCON0,3)
// PCON0<nRWDT>
extern volatile __bit                   nRWDT               __at(0xC94);	// @ (0x192 * 8 + 4)
#define                                 nRWDT_bit           _BIT_ACCESS(PCON0,4)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// T3CON<nT3SYNC>
extern volatile __bit                   nT3SYNC             __at(0x18A2);	// @ (0x314 * 8 + 2)
#define                                 nT3SYNC_bit         _BIT_ACCESS(T3CON,2)
// STATUS<nTO>
extern volatile __bit                   nTO                 __at(0x1C);	// @ (0x3 * 8 + 4)
#define                                 nTO_bit             _BIT_ACCESS(STATUS,4)
// PCON0<nWDTWV>
extern volatile __bit                   nWDTWV              __at(0xC95);	// @ (0x192 * 8 + 5)
#define                                 nWDTWV_bit          _BIT_ACCESS(PCON0,5)
// SSP1STAT<nWRITE1>
extern volatile __bit                   nWRITE1             __at(0x3C7A);	// @ (0x78F * 8 + 2)
#define                                 nWRITE1_bit         _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<nWRITE2>
extern volatile __bit                   nWRITE2             __at(0x3CCA);	// @ (0x799 * 8 + 2)
#define                                 nWRITE2_bit         _BIT_ACCESS(SSP2STAT,2)

#endif // _PIC16F17144_H_
